espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_aead.c
  uint8_t calc_tag[16] = { 0 };
  uint32_t diff = 0;

  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(alg, 0)) {
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
      // Verify key type
      if (psa_get_key_type(attributes) != PSA_KEY_TYPE_AES) {
        return PSA_ERROR_NOT_SUPPORTED;
      }

      psa_status = sli_ccm_crypt_and_tag(&operation,
                                         PSA_CRYPTO_DRIVER_DECRYPT,
                                         ciphertext_length,
                                         nonce,
                                         nonce_length,
                                         additional_data,
                                         additional_data_length,
                                         ciphertext,
                                         plaintext,
                                         calc_tag,
                                         tag_length);

      if (psa_status != PSA_SUCCESS) {
        return psa_status;
      }

      // Check that the provided tag equals the calculated one
      // (in constant time). Note that the tag returned by ccm_auth_crypt
      // is encrypted, so we don't have to decrypt the tag.
      diff = sli_psa_safer_memcmp(calc_tag, tag, tag_length);
      sli_psa_zeroize(calc_tag, tag_length);

      if (diff != 0) {
        *plaintext_length = 0;
        sli_psa_zeroize(plaintext, ciphertext_length);
        psa_status = PSA_ERROR_INVALID_SIGNATURE;
      } else {
        *plaintext_length = ciphertext_length;
        psa_status = PSA_SUCCESS;
      }

      break;
#endif // PSA_WANT_ALG_CCM
#if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0): {
      // Verify key type
      if (psa_get_key_type(attributes) != PSA_KEY_TYPE_AES) {
        return PSA_ERROR_NOT_SUPPORTED;
      }

      sli_gcm_crypt_and_tag(&operation,
                            PSA_CRYPTO_DRIVER_DECRYPT,
                            ciphertext_length,
                            nonce,
                            nonce_length,
                            additional_data,
                            additional_data_length,
                            ciphertext,
                            plaintext,
                            tag_length,
                            calc_tag);

      sli_psa_zeroize(&operation, sizeof(operation));

      // Check that the provided tag equals the calculated one
      // (in constant time). Note that the tag computed
      // is encrypted, so we don't have to decrypt check_tag.
      diff = sli_psa_safer_memcmp(calc_tag, tag, tag_length);
      sli_psa_zeroize(calc_tag, tag_length);

      if (diff != 0) {
        *plaintext_length = 0;
        sli_psa_zeroize(plaintext, ciphertext_length);
        psa_status = PSA_ERROR_INVALID_SIGNATURE;
      } else {
        *plaintext_length = ciphertext_length;
        psa_status = PSA_SUCCESS;
      }

      break;
    }
#endif // PSA_WANT_ALG_GCM
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }

  return psa_status;

#else // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM

  (void)attributes;
  (void)key_buffer;
  (void)key_buffer_size;
  (void)alg;
  (void)nonce;
  (void)nonce_length;
  (void)additional_data;
  (void)additional_data_length;
  (void)plaintext;
  (void)plaintext_size;
  (void)plaintext_length;
  (void)ciphertext;
  (void)ciphertext_length;
  (void)tag;
  (void)tag_length;

  return PSA_ERROR_NOT_SUPPORTED;

#endif // PSA_WANT_ALG_CCM || PSA_WANT_ALG_GCM
}

/*******************************************************************************
 **************************    LOCAL FUNCTIONS   *******************************
 ******************************************************************************/

#if defined(PSA_WANT_ALG_CCM)

__STATIC_INLINE
void update_cbc_mac(CRYPTO_TypeDef *crypto, unsigned char *b)
{
  // Every call to the crypto accelerator follows the following conventions:
  //  DATA0: Data to be processed
  //  DATA1: Counter
  //  DATA2: Tag
  //  DATA3: Temporary register
  while ((crypto->STATUS & CRYPTO_STATUS_SEQRUNNING) != 0) ;
  CRYPTO_DataWriteUnaligned(&crypto->DATA0, (uint8_t *)b);
  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_DATA2TODATA0XOR,
                   CRYPTO_CMD_INSTR_AESENC,
                   CRYPTO_CMD_INSTR_DATA0TODATA2);
}

#endif // PSA_WANT_ALG_CCM
/*
 * The GCM algorithm is based on two main functions, GHASH and GCTR, defined
 * in http://csrc.nist.gov/publications/nistpubs/800-38D/SP-800-38D.pdf
 *
 * The GHASH and GCTR fuctions can be implemented with the following
 * instruction sequences that can be executed by the CRYPTO peripheral.
 */

/*
 * GCTR_SEQUENCE for encryption and decryption.
 *
 * Procedure is executed with following assumptions:
 * - data to be processed is in DATA0
 * - DATA1 contains counter which is preincremented
 * - DATA3 is used as temporary register
 * - result is stored in DATA0
 *
 *   CRYPTO_CMD_INSTR_DATA0TODATA3
 *   CRYPTO_CMD_INSTR_DATA1INC
 *   CRYPTO_CMD_INSTR_DATA1TODATA0
 *   CRYPTO_CMD_INSTR_AESENC
 *   CRYPTO_CMD_INSTR_DATA3TODATA0XOR
 */

/*
 * GHASH_SEQUENCE for encryption, decryption and tag
 *
 * Procedure is executed with following assumptions:
 * - data to be processed is in DATA0 ( A[i] or C[i] )
 * - temporary GHASH is stored in DDATA0
 * - H is stored in DATA2 (part of DDATA3)
 * - DDATA1 is used temporary for holding input to the MMUL instruction
 *   (MMUL DDATA0 = (DDATA1 * V1) mod P V1 != DDATA0,DDATA1)
 *
 *  Note: The DDATA3 in SELDDATA0DDATA3 is for the BBSWAP128.
 *
 *  CRYPTO_CMD_INSTR_SELDDATA0DDATA2
 *  CRYPTO_CMD_INSTR_XOR
 *  CRYPTO_CMD_INSTR_BBSWAP128
 *  CRYPTO_CMD_INSTR_DDATA0TODDATA1
 *  CRYPTO_CMD_INSTR_SELDDATA0DDATA3
 *  CRYPTO_CMD_INSTR_MMUL
 *  CRYPTO_CMD_INSTR_BBSWAP128
 */

/*
 * CRYPTO register usage:
 *  DATA0 - temporary result and plaintext
 *  DATA1 - Counter state
 *  DATA2 - Hash key
 *  DATA3 - used temporary
 *
 *  DDATA0 - temporary results in the GHASH function (Xi-1)
 *  DDATA1 - temporary for MMUL operands
 *  DDATA2 - overlaps DATA0 and DATA1
 *  DDATA3 - overlaps DATA2 and DATA3
 *  DDATA4 - KEYBUF
 */

#if defined(PSA_WANT_ALG_GCM)

__STATIC_INLINE void gcm_restore_crypto_state(sli_crypto_transparent_aead_operation_t *operation,
                                              CRYPTO_TypeDef *crypto)
{
  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_CRITICAL();

  // Restore state
  if (operation->key_len == 16U) {
    // Set AES-128 mode
    crypto->CTRL = CRYPTO_CTRL_AES_AES128
                   | CRYPTO_CTRL_INCWIDTH_INCWIDTH4 | CRYPTO_CTRL_DMA0RSEL_DATA0;
  } else {
    // Set AES-256 mode
    crypto->CTRL = CRYPTO_CTRL_AES_AES256
                   | CRYPTO_CTRL_INCWIDTH_INCWIDTH4 | CRYPTO_CTRL_DMA0RSEL_DATA0;
  }

