espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_aead.c
  CRYPTO_KeyBufWriteUnaligned(crypto,
                              operation->key,
                              (operation->key_len == 16U) ? cryptoKey128Bits
                              : cryptoKey256Bits);

  crypto->WAC = CRYPTO_WAC_MODULUS_GCMBIN128 | CRYPTO_WAC_RESULTWIDTH_128BIT;
  CRYPTO_DataWrite(&crypto->DATA2, operation->ctx.gcm_ctx.ghash_key);
  CRYPTO_DataWrite(&crypto->DATA1, operation->ctx.gcm_ctx.gctr_state);
  // Write GHASH state (128 bits) temporarily to DATA0 (in DDATA2) then
  // move it to DDATA0 (256 bits) where CRYPTO expects it.
  CRYPTO_DataWrite(&crypto->DATA0, operation->ctx.gcm_ctx.ghash_state);
  crypto->CMD = CRYPTO_CMD_INSTR_DDATA2TODDATA0;

  CORE_EXIT_CRITICAL();
}

// Start GCM streaming operation
static void sli_gcm_starts(sli_crypto_transparent_aead_operation_t *operation,
                           CRYPTO_TypeDef *device,
                           psa_encrypt_or_decrypt_t mode,
                           const unsigned char *iv,
                           size_t iv_len)
{
  bool            store_state_and_release;
  CRYPTO_TypeDef *crypto;
  CORE_DECLARE_IRQ_STATE;

  (void) iv_len; // checked in check_aead_parameters()

  // AD are limited to 2^64 bits, so 2^61 bytes.
  // We need not check if SIZE_MAX (max of size_t) is less than 2^61 (0x2000000000000000)
#if SIZE_MAX > 0x2000000000000000ull
#error not supported
  if (((uint64_t) add_len) >> 61 != 0) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }
#endif

  // Check if this context has already acquired a crypto device, which means
  // the caller should be mbedtls_gcm_crypt_and_tag() which will perform GCM
  // on a full block and call starts, update, finish in a sequence meaning we
  // will not need to store the state in between.
  if (device == NULL) {
    crypto = crypto_management_acquire();
    store_state_and_release = true;
  } else {
    store_state_and_release = false;
    crypto = device;
  }

  // Setup CRTL and KEY
  //   - AES-128 or AES-256 mode
  //   - width of counter in CTR cipher mode to 4 bytes.
  //   - associate DATA0 with DMA instructions which are used in order to
  //     synchronize with MCU load/store during instruction sequence loops
  //     (a DMA engine is not used).
  if (operation->key_len == 16U) {
    // Set AES-128 mode
    crypto->CTRL = CRYPTO_CTRL_AES_AES128
                   | CRYPTO_CTRL_INCWIDTH_INCWIDTH4 | CRYPTO_CTRL_DMA0RSEL_DATA0;
  } else {
    // Set AES-256 mode
    crypto->CTRL = CRYPTO_CTRL_AES_AES256
                   | CRYPTO_CTRL_INCWIDTH_INCWIDTH4 | CRYPTO_CTRL_DMA0RSEL_DATA0;
  }

  CRYPTO_KeyBufWriteUnaligned(crypto,
                              operation->key,
                              (operation->key_len == 16U) ? cryptoKey128Bits
                              : cryptoKey256Bits);

  // Set GCM modulus, operand and result widths
  crypto->WAC   = CRYPTO_WAC_MODULUS_GCMBIN128 | CRYPTO_WAC_RESULTWIDTH_128BIT;
  crypto->SEQCTRL  = 16;
  crypto->SEQCTRLB = 0;

  // Load the initial counter value Y0 into DATA1.
  //   Y0 = IV | 1
  //   That is, the 12 byte Initial Vector concatenated with the initial
  //   counter value 1 in the least significant 32bit word.
  memcpy(operation->ctx.gcm_ctx.gctr_state, iv, 12);
  operation->ctx.gcm_ctx.gctr_state[3] = 0x01000000;
  CRYPTO_DataWrite(&crypto->DATA1, operation->ctx.gcm_ctx.gctr_state);

  CORE_ENTER_CRITICAL();

  // Organize and Compute the initial values.
  CRYPTO_EXECUTE_6(crypto,
                   // Compute hash key H=E(K,0) in DATA2 (LSB DDATA3)
                   CRYPTO_CMD_INSTR_DATA0TODATA0XOR,// DATA0 = 0
                   CRYPTO_CMD_INSTR_AESENC,         // DATA0 = AESENC(DATA0)
                   CRYPTO_CMD_INSTR_SELDDATA2DDATA2,// Select DATA0 for BBSWAP
                   CRYPTO_CMD_INSTR_BBSWAP128,      // Swap bit in H, for GMAC
                   // Move resulting hash key (DDATA0 LSB) to DATA2 (DDATA3 LSB)
                   CRYPTO_CMD_INSTR_DDATA0TODDATA3,
                   // Prepare GHASH(H,A)
                   CRYPTO_CMD_INSTR_CLR             // DDATA0 = 0
                   );

  CORE_EXIT_CRITICAL();

#if defined(SLI_PSA_SUPPORT_GCM_IV_CALCULATION)
  // When len(IV) != 12, then IV = GHASH(zero-extended-IV)
  uint32_t temp[4];
  if (iv_len != 12) {
    // Start GHASH from a zero state
    // DATA2 has the hash key
    // DDATA0 has the initial state (all-zero)
    crypto->SEQCTRL = (iv_len & 0xFFFFFFF0u) + ((iv_len & 0xF) ? 16 : 0) + 16;

    CORE_ENTER_CRITICAL();

    // Run GHASH sequence on IV input
    CRYPTO_EXECUTE_8(crypto,
                     // Load IV input block
                     CRYPTO_CMD_INSTR_DMA0TODATA,       // DATA0 = input block
                     // GHASH_SEQUENCE (see desc above)
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA2,  // V0 = DDATA0, V1 = DDATA2
                     CRYPTO_CMD_INSTR_XOR,              // DDATA0 = DDATA0 ^ DDATA2
                     CRYPTO_CMD_INSTR_BBSWAP128,        // bitswap DDATA0[127:0]
                     CRYPTO_CMD_INSTR_DDATA0TODDATA1,   // DDATA1 = DDATA0
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA3,  // V0 = DDATA0, V1 = DDATA3
                     CRYPTO_CMD_INSTR_MMUL,             // DDATA0 = DDATA1 * DDATA3 mod P
                     CRYPTO_CMD_INSTR_BBSWAP128         // bitswap DDATA0[127:0]
                     );

    // First loop through and write data for all complete blocks
    size_t iv_bytes_left = iv_len;
    while (iv_bytes_left >= 16) {
      iv_bytes_left -= 16;
      // Wait for sequencer to accept data
      while (!(crypto->STATUS & CRYPTO_STATUS_DMAACTIVE)) ;
      CRYPTO_DataWriteUnaligned(&crypto->DATA0, iv);
      iv += 16;
    }
    if (iv_bytes_left > 0) {
      // For last incomplete block, use temporary buffer for zero padding.
      memset(temp, 0, sizeof(temp));
      memcpy(temp, iv, iv_bytes_left);
      while (!(crypto->STATUS & CRYPTO_STATUS_DMAACTIVE)) ;
      CRYPTO_DataWrite(&crypto->DATA0, temp);
    }
    // Finish with adding in len(C)
    uint64_t bitlen = iv_len * 8;
    while (!(crypto->STATUS & CRYPTO_STATUS_DMAACTIVE)) ;
    crypto->DATA0 = 0;
    crypto->DATA0 = 0;
    crypto->DATA0 = __REV((uint32_t) (bitlen >> 32));
    crypto->DATA0 = __REV((uint32_t) bitlen);

    // Wait for completion
    while (!CRYPTO_InstructionSequenceDone(crypto)) ;

