espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_aead.c
    CORE_EXIT_CRITICAL();

    // Copy out calculated IV to context and DATA1
    crypto->CMD = CRYPTO_CMD_INSTR_DDATA0TODDATA2;
    crypto->CMD = CRYPTO_CMD_INSTR_DATA0TODATA1;
    CRYPTO_DataRead(&crypto->DATA0, operation->ctx.gcm_ctx.gctr_state);

    // Reset GHASH state
    crypto->CMD = CRYPTO_CMD_INSTR_CLR;
  }
#endif // SLI_PSA_SUPPORT_GCM_IV_CALCULATION

  // Remember IV since we need it for the finish operation
  CRYPTO_DataRead(&crypto->DATA1, operation->ctx.gcm_ctx.iv);

  // Remember mode and additional authentication length
  operation->direction = mode;
  // Reset data length to zero.
  operation->processed_len = 0;

  if (store_state_and_release) {
    CORE_ENTER_CRITICAL();
    // Move GHASH state in DDATA0 temporarily to DATA0 (in DDATA2) in order to
    // read only the 128 bits value (since DDATA0 is 256 bits wide).
    crypto->CMD = CRYPTO_CMD_INSTR_DDATA0TODDATA2;
    CRYPTO_DataRead(&crypto->DATA0, operation->ctx.gcm_ctx.ghash_state);
    CRYPTO_DataRead(&crypto->DATA2, operation->ctx.gcm_ctx.ghash_key);
    CORE_EXIT_CRITICAL();

    crypto_management_release(crypto);
  }
  return;
}

// Add authentication data.
static void crypto_gcm_update_partial_ad(sli_crypto_transparent_aead_operation_t *operation,
                                         CRYPTO_TypeDef *device,
                                         const unsigned char *add,
                                         size_t add_len)
{
  bool            store_state_and_release;
  CRYPTO_TypeDef *crypto;
  uint32_t        temp[4];
  unsigned int    complete_blocks_in_bytes;
  bool            last_block_is_incomplete;
  CORE_DECLARE_IRQ_STATE;

  // Check if this context has already acquired a crypto device, which means
  // the caller should be mbedtls_gcm_crypt_and_tag() which will perform GCM
  // on a full block and call starts, update, finish in a sequence meaning we
  // will not need to store the state in between.
  if (device == NULL) {
    crypto = crypto_management_acquire();
    store_state_and_release = true;
    gcm_restore_crypto_state(operation, crypto);
  } else {
    store_state_and_release = false;
    crypto = device;
  }

  // Process additional authentication data if present.
  crypto->SEQCTRLB = 0; // Sequence B is not used for auth data

  operation->add_len += add_len;
  while (add_len) {
    if (add_len > (_CRYPTO_SEQCTRL_LENGTHA_MASK & 0xFFFFFFF0u)) {
      complete_blocks_in_bytes = _CRYPTO_SEQCTRL_LENGTHA_MASK & 0xFFFFFFF0u;
      last_block_is_incomplete = false;
      add_len -= complete_blocks_in_bytes;
    } else {
      // Calculate total sequence length 16*num_complete_blocks, plus 16 if
      // there is an incomplete block at the end.
      last_block_is_incomplete = add_len & 0xF;
      complete_blocks_in_bytes = add_len & 0xFFFFFFF0u;
      add_len = add_len & 0xF;
    }

    // Set SEQCTRL_LENGTHA to loop through all blocks
    crypto->SEQCTRL = complete_blocks_in_bytes + (last_block_is_incomplete ? 16 : 0);

    CORE_ENTER_CRITICAL();

    // Run GHASH sequence on additional authentication data
    CRYPTO_EXECUTE_8(crypto,
                     // Load additional auth data
                     CRYPTO_CMD_INSTR_DMA0TODATA,
                     // GHASH_SEQUENCE (see desc above)
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA2,
                     CRYPTO_CMD_INSTR_XOR,
                     CRYPTO_CMD_INSTR_BBSWAP128,
                     CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                     CRYPTO_CMD_INSTR_SELDDATA0DDATA3,
                     CRYPTO_CMD_INSTR_MMUL,
                     CRYPTO_CMD_INSTR_BBSWAP128
                     );

    // Loop through all complete blocks and write additional auth data to CRYPTO.
    while (complete_blocks_in_bytes >= 16) {
      complete_blocks_in_bytes  -= 16;
      // Wait for sequencer to accept data
      while (!(crypto->STATUS & CRYPTO_STATUS_DMAACTIVE)) ;
      CRYPTO_DataWriteUnaligned(&crypto->DATA0, add);
      add      += 16;
    }
    if (last_block_is_incomplete) {
      // For last incomplete block, use temporary buffer for zero padding.
      memset(temp, 0, sizeof(temp));
      memcpy(temp, add, add_len);
      while (!(crypto->STATUS & CRYPTO_STATUS_DMAACTIVE)) ;
      CRYPTO_DataWrite(&crypto->DATA0, temp);

      // Done,, set add_len to zero to exit loop.
      add_len = 0;
    }
    // Wait for completion
    while (!CRYPTO_InstructionSequenceDone(crypto)) ;

    CORE_EXIT_CRITICAL();
  }
  if (store_state_and_release) {
    CORE_ENTER_CRITICAL();
    // Move GHASH state in DDATA0 temporarily to DATA0 (in DDATA2) in order to
    // read only the 128 bits value (since DDATA0 is 256 bits wide).
    crypto->CMD = CRYPTO_CMD_INSTR_DDATA0TODDATA2;
    CRYPTO_DataRead(&crypto->DATA0, operation->ctx.gcm_ctx.ghash_state);
    CRYPTO_DataRead(&crypto->DATA2, operation->ctx.gcm_ctx.ghash_key);
    CORE_EXIT_CRITICAL();

    crypto_management_release(crypto);
  }
  return;
}

// Update a GCM streaming operation with more input data to be
// encrypted or decrypted.
static void sli_gcm_update(sli_crypto_transparent_aead_operation_t *operation,
                           CRYPTO_TypeDef *device,
                           size_t length,
                           const unsigned char *input,
                           unsigned char *output)
{
  bool            restore_state_and_release;
  CRYPTO_TypeDef *crypto;
  uint32_t        temp[4];
  unsigned int    complete_blocks_in_bytes;
  bool            last_block_is_incomplete;
  CORE_DECLARE_IRQ_STATE;

  if (length == 0) {
    return;
  }

  // Total length is restricted to 2^39 - 256 bits, ie 2^36 - 2^5 bytes
  // Also check for possible overflow.
  // We need not check if SIZE_MAX (max of size_t) is less than 2^36-2^5 (0xFFFFFFFE0)
#if SIZE_MAX > 0xFFFFFFFE0ull
#error not supported
  if (operation->processed_len + length < operation->processed_len
      || (uint64_t) operation->processed_len + length > 0xFFFFFFFE0ull) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }
#endif

  // Check if this context has already acquired a crypto device, which means
  // the caller should be mbedtls_gcm_crypt_and_tag() which will perform GCM
  // on a full block and call starts, update, finish in a sequence meaning we
  // will not need to store the state in between.
  if (device == NULL) {
    crypto = crypto_management_acquire();
    restore_state_and_release = true;
    gcm_restore_crypto_state(operation, crypto);
  } else {
    restore_state_and_release = false;
    crypto = device;
  }

  operation->processed_len += length;

  while (length) {
    if (length > (_CRYPTO_SEQCTRL_LENGTHA_MASK & 0xFFFFFFF0u)) {
      last_block_is_incomplete = false;
      complete_blocks_in_bytes = _CRYPTO_SEQCTRL_LENGTHA_MASK & 0xFFFFFFF0u;
      length -= complete_blocks_in_bytes;
    } else {
      // Calculate total sequence length 16*num_complete_blocks, plus 16 if
      // there is an incomplete block at the end.
      last_block_is_incomplete = length & 0xF;
      complete_blocks_in_bytes = length & 0xFFFFFFF0u;
      length = length & 0xF; // length of last incomplete block
    }

    CORE_ENTER_CRITICAL();

    if (operation->direction == PSA_CRYPTO_DRIVER_DECRYPT) {
      crypto->SEQCTRL  = complete_blocks_in_bytes + (last_block_is_incomplete ? 16 : 0);
      crypto->SEQCTRLB = 0;

