espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_aead.c
      // Start decryption sequence
      CRYPTO_EXECUTE_14(crypto,
                        CRYPTO_CMD_INSTR_DMA0TODATA,  // Load Ciphertext

                        // GHASH_SEQUENCE (see desc above)
                        CRYPTO_CMD_INSTR_SELDDATA0DDATA2,
                        CRYPTO_CMD_INSTR_XOR,
                        CRYPTO_CMD_INSTR_BBSWAP128,
                        CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                        CRYPTO_CMD_INSTR_SELDDATA0DDATA3,
                        CRYPTO_CMD_INSTR_MMUL,
                        CRYPTO_CMD_INSTR_BBSWAP128,

                        // GCTR_SEQUENCE (see desc above)
                        CRYPTO_CMD_INSTR_DATA0TODATA3,
                        CRYPTO_CMD_INSTR_DATA1INC,
                        CRYPTO_CMD_INSTR_DATA1TODATA0,
                        CRYPTO_CMD_INSTR_AESENC,
                        CRYPTO_CMD_INSTR_DATA3TODATA0XOR,
                        CRYPTO_CMD_INSTR_DATATODMA0   // Store Plaintext
                        );
    } else {
      // For encryption we need to handle the last block differently if it is
      // incomplete. We need to zeroize bits outside len(PT) in DATA0 before
      // the GHASH operation. We do this by using a DMA0TODATA instruction in
      // the B sequence, meaning that the sequencer will wait for the MCU core
      // to zeroize bits and write them back to DATA0.
      crypto->SEQCTRL  = complete_blocks_in_bytes;
      crypto->SEQCTRLB = last_block_is_incomplete ? 16 : 0;

      // Start encryption sequence
      CRYPTO_EXECUTE_17(crypto,
                        CRYPTO_CMD_INSTR_DMA0TODATA,  // Load Plaintext

                        // GCTR_SEQUENCE (see desc above)
                        CRYPTO_CMD_INSTR_DATA0TODATA3,
                        CRYPTO_CMD_INSTR_DATA1INC,
                        CRYPTO_CMD_INSTR_DATA1TODATA0,
                        CRYPTO_CMD_INSTR_AESENC,
                        CRYPTO_CMD_INSTR_DATA3TODATA0XOR,
                        CRYPTO_CMD_INSTR_DATATODMA0,  // Store Ciphertext

                        CRYPTO_CMD_INSTR_EXECIFB,
                        CRYPTO_CMD_INSTR_DMA0TODATA,  // Load X XOR MSB(CIPH(CB))
                        CRYPTO_CMD_INSTR_EXECALWAYS,

                        // GHASH_SEQUENCE (see desc above)
                        CRYPTO_CMD_INSTR_SELDDATA0DDATA2,
                        CRYPTO_CMD_INSTR_XOR,
                        CRYPTO_CMD_INSTR_BBSWAP128,
                        CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                        CRYPTO_CMD_INSTR_SELDDATA0DDATA3,
                        CRYPTO_CMD_INSTR_MMUL,
                        CRYPTO_CMD_INSTR_BBSWAP128
                        );
    }

    // Loop through all complete blocks, write input data and read output data.
    while (complete_blocks_in_bytes >= 16) {
      complete_blocks_in_bytes -= 16;
      // Wait for sequencer to accept data
      while (!(crypto->STATUS & CRYPTO_STATUS_DMAACTIVE)) ;
      CRYPTO_DataWriteUnaligned(&crypto->DATA0, input);
      input   += 16;
      // Wait for sequencer to finish iteration and make data available
      while (!(crypto->STATUS & CRYPTO_STATUS_DMAACTIVE)) ;
      CRYPTO_DataReadUnaligned(&crypto->DATA0, output);
      output  += 16;
    }

    if (last_block_is_incomplete) {
      // The last block is incomplete, so we need to zero pad bits outside len(PT)
      // Use temporary buffer for zero padding
      memset(temp, 0, sizeof(temp));
      memcpy(temp, input, length);

      while (!(crypto->STATUS & CRYPTO_STATUS_DMAACTIVE)) ;
      // Write last input data (PT/CT)
      CRYPTO_DataWrite(&crypto->DATA0, temp);
      while (!(crypto->STATUS & CRYPTO_STATUS_DMAACTIVE)) ;
      // Read last output data (CT/PT)
      CRYPTO_DataRead(&crypto->DATA0, temp);

      if (operation->direction == PSA_CRYPTO_DRIVER_ENCRYPT) {
        // For encryption, when the last block is incomplete we need to
        // zeroize bits outside len(PT) in DATA0 before the GHASH operation.
        memset(&((uint8_t*)temp)[length], 0, 16 - length);
        CRYPTO_DataWrite(&crypto->DATA0, temp);
      }

      // Copy to output buffer now while CRYPTO performs GHASH.
      memcpy(output, temp, length);

      // Done,, set length to zero to exit loop.
      length = 0;
    }

    // Wait for completion
    while (!CRYPTO_InstructionSequenceDone(crypto)) ;

    CORE_EXIT_CRITICAL();
  }

  if (restore_state_and_release) {
    CORE_ENTER_CRITICAL();
    CRYPTO_DataRead(&crypto->DATA1, operation->ctx.gcm_ctx.gctr_state);
    // Move GHASH state in DDATA0 temporarily to DATA2 (in DDATA3) in order to
    // read only the 128 bits value (since DDATA0 is 256 bits wide).
    crypto->CMD = CRYPTO_CMD_INSTR_DDATA0TODDATA3;
    CRYPTO_DataRead(&crypto->DATA2, operation->ctx.gcm_ctx.ghash_state);
    CORE_EXIT_CRITICAL();

    crypto_management_release(crypto);
  }

  return;
}

// Finish GCM streaming operation
static void sli_gcm_finish(sli_crypto_transparent_aead_operation_t *operation,
                           CRYPTO_TypeDef *device,
                           unsigned char *tag,
                           size_t tag_len)
{
  uint64_t        bit_len;
  uint32_t        temp[4];
  CRYPTO_TypeDef *crypto;
  CORE_DECLARE_IRQ_STATE;

  bool            restore_state_and_release;
  // Check if this context has already acquired a crypto device, which means
  // the caller should be mbedtls_gcm_crypt_and_tag() which will perform GCM
  // on a full block and call starts, update, finish in a sequence meaning we
  // will not need to store the state in between.
  if (device == NULL) {
    crypto = crypto_management_acquire();
    restore_state_and_release = true;
    gcm_restore_crypto_state(operation, crypto);
  } else {
    restore_state_and_release = false;
    crypto = device;
  }

  // Compute last part of the GHASH and authentication tag:
  //
  // Xm+n+1 = (Xm+n XOR (len(A)|len(C))) * H
  //
  // Compute the final authentication tag now.
  // T = MSBt (GHASH(H, A, C) XOR E(K, Y0))
  // where GHASH(H, A, C) is Xm+n+1 which is stored in DATA0 (LSWord of DDATA2)
  // and Counter value Yn is stored in DATA1. We assume N (in Yn) is not bigger
  // than 2^32 so E(K, Y0) derived by clearing DATA1 which gives Y0.
  crypto->SEQCTRL = 16;
  crypto->SEQCTRLB = 0;

  CORE_ENTER_CRITICAL();

