espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_aead.c
  // Temporarily load length fields value 128 bits into DATA0 register
  // Then move it into LSB of DDATA1 (for optimal performance)
  bit_len = (uint64_t)operation->add_len * 8;
  crypto->DATA0 = __REV((uint32_t) (bit_len >> 32));
  crypto->DATA0 = __REV((uint32_t) bit_len);
  bit_len = (uint64_t)operation->processed_len * 8;
  crypto->DATA0 = __REV((uint32_t) (bit_len >> 32));
  crypto->DATA0 = __REV((uint32_t) bit_len);

  // Calculate last part of GHASH (in DDATA0)
  // adding in length fields in DATA0 ( LSB of DDATA2 )
  CRYPTO_EXECUTE_7(crypto,
                   // See descripton of GHASH_SEQUENCE above.
                   CRYPTO_CMD_INSTR_SELDDATA0DDATA2, // A[i] and Xi-1
                   CRYPTO_CMD_INSTR_XOR,
                   CRYPTO_CMD_INSTR_BBSWAP128,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA1,
                   CRYPTO_CMD_INSTR_SELDDATA0DDATA3, // temp result and H
                   CRYPTO_CMD_INSTR_MMUL,       // Xi is stored in DDATA0
                   CRYPTO_CMD_INSTR_BBSWAP128);

  while (!CRYPTO_InstructionSequenceDone(crypto)) ;

  // With the GHASH result in DDATA0, we can reinstate the initial IV
  // and calculate tag = GHASH ^ AESENC(IV)
  CRYPTO_DataWrite(&crypto->DATA0, operation->ctx.gcm_ctx.iv);
  CRYPTO_EXECUTE_3(crypto,
                   CRYPTO_CMD_INSTR_DDATA0TODDATA3,   // GHASH result to DATA2
                   // Calculate AuthTag
                   CRYPTO_CMD_INSTR_AESENC,
                   CRYPTO_CMD_INSTR_DATA2TODATA0XOR); // DATA0 = DATA0 ^ DATA2

  // Wait for completion
  while (!CRYPTO_InstructionSequenceDone(crypto)) ;

  if (tag_len) {
    CRYPTO_DataRead(&crypto->DATA0, temp);
    memcpy(tag, temp, tag_len);
  }

  CORE_EXIT_CRITICAL();

  if (restore_state_and_release) {
    crypto_management_release(crypto);
  }
  return;
}

// Perform full GCM block encryption or decryption operation with tag.
static void sli_gcm_crypt_and_tag(sli_crypto_transparent_aead_operation_t *operation,
                                  psa_encrypt_or_decrypt_t mode,
                                  size_t length,
                                  const unsigned char *iv,
                                  size_t iv_len,
                                  const unsigned char *add,
                                  size_t add_len,
                                  const unsigned char *input,
                                  unsigned char *output,
                                  size_t tag_len,
                                  unsigned char *tag)
{
  CRYPTO_TypeDef *device = crypto_management_acquire();

  sli_gcm_starts(operation, device, mode, iv, iv_len);
  crypto_gcm_update_partial_ad(operation, device, add, add_len);
  sli_gcm_update(operation, device, length, input, output);
  sli_gcm_finish(operation, device, tag, tag_len);

  crypto_management_release(device);

  return;
}

#endif // PSA_WANT_ALG_GCM

#if defined(PSA_WANT_ALG_CCM)

__STATIC_INLINE void ccm_restore_crypto_state(sli_crypto_transparent_aead_operation_t *operation,
                                              CRYPTO_TypeDef *crypto)
{
  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_CRITICAL();

  CRYPTO_KeyBufWriteUnaligned(crypto,
                              operation->key,
                              (operation->key_len == 16U) ? cryptoKey128Bits
                              : cryptoKey256Bits);

  CRYPTO_DataWriteUnaligned(&crypto->DATA1, (uint8_t *)operation->ctx.ccm_ctx.cctr_state);

  CORE_EXIT_CRITICAL();
}

static void crypto_ccm_update_partial_ad(sli_crypto_transparent_aead_operation_t *operation,
                                         CRYPTO_TypeDef *device,
                                         const unsigned char *add,
                                         size_t add_len)
{
  size_t len_left;
  unsigned char b[16];
  const unsigned char *src;

  CRYPTO_TypeDef *crypto;
  CORE_DECLARE_IRQ_STATE;

  // Check if this context has already acquired a crypto device, which means
  // the caller should be sli_ccm_crypt_and_tag() which will perform CCM
  // on a full block and call starts, update, finish in a sequence meaning we
  // will not need to store the state in between.
  if (device == NULL) {
    crypto = crypto_management_acquire();
    ccm_restore_crypto_state(operation, crypto);
  } else {
    crypto = device;
  }

  // If there is additional data, update CBC-MAC with
  // add_len, add, 0 (padding to a block boundary).
  if (add_len > 0) {
    size_t use_len;
    len_left = add_len;
    src = add;
    CORE_ENTER_CRITICAL();
    if (operation->first_update_ad_op) {
      memset(b, 0, sizeof(b));
      b[0] = (unsigned char)((operation->add_len >> 8) & 0xFF);
      b[1] = (unsigned char)((operation->add_len) & 0xFF);

      use_len = len_left < 16 - 2 ? len_left : 16 - 2;
      memcpy(b + 2, src, use_len);
      len_left -= use_len;
      src += use_len;

      update_cbc_mac(crypto, b);
      operation->first_update_ad_op = false;
    }

    while (len_left > 0) {
      use_len = len_left > 16 ? 16 : len_left;

      memset(b, 0, sizeof(b));
      memcpy(b, src, use_len);
      update_cbc_mac(crypto, b);

      len_left -= use_len;
      src += use_len;
    }

    CORE_EXIT_CRITICAL();
  }
}

// Start CCM streaming operation.
static psa_status_t sli_ccm_starts(sli_crypto_transparent_aead_operation_t *operation,
                                   CRYPTO_TypeDef *device,
                                   psa_encrypt_or_decrypt_t mode,
                                   const unsigned char *iv,
                                   size_t iv_len,
                                   size_t tag_len,
                                   size_t message_len)
{
  unsigned char i;
  unsigned char q;
  size_t len_left;
  unsigned char b[16];
  unsigned char ctr[16];

  CRYPTO_TypeDef *crypto;
  CORE_DECLARE_IRQ_STATE;

  // Check remaining length requirements: SP800-38C A.1
  // Additional requirement: a < 2^16 - 2^8 to simplify the code.
  // 'length' checked later (when writing it to the first block)

  // Also, loosen the requirements to enable support for CCM* (IEEE 802.15.4).

  bool            store_state_and_release;
  // Check if this context has already acquired a crypto device, which means
  // the caller should be sli_ccm_crypt_and_tag() which will perform CCM
  // on a full block and call starts, update, finish in a sequence meaning we
  // will not need to store the state in between.
  if (device == NULL) {
    crypto = crypto_management_acquire();
    store_state_and_release = true;
  } else {
    store_state_and_release = false;
    operation->first_update_ad_op = true;
    crypto = device;
  }

  // Remember mode and initialize additional authentication length.
  operation->add_len = operation->ctx.preinit.add_len;
  operation->direction = mode;
  // Reset data length to zero.
  operation->processed_len = 0;
  // Save IV and IV length for finish step.
  operation->ctx.ccm_ctx.iv_len = iv_len;
  memcpy(operation->ctx.ccm_ctx.iv, iv, iv_len);

  q = 16 - 1 - (unsigned char) iv_len;

  // First block B_0:
  // 0        .. 0        flags
  // 1        .. iv_len   nonce (aka iv)
  // iv_len+1 .. 15       length
  //
  // With flags as (bits):
  // 7        0
  // 6        add present?
  // 5 .. 3   (t - 2) / 2
  // 2 .. 0   q - 1

