espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_aead.c
  b[0] = 0;
  b[0] |= (operation->add_len > 0) << 6;
  b[0] |= ((tag_len - 2) / 2) << 3;
  b[0] |= q - 1;

  memcpy(b + 1, iv, iv_len);

  for (i = 0, len_left = message_len; i < q; i++, len_left >>= 8) {
    b[15 - i] = (unsigned char)(len_left & 0xFF);
  }

  if (len_left > 0) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  crypto->WAC = 0;
  crypto->CTRL = 0;

  // Set the encryption key.
  CORE_ENTER_CRITICAL();
  CRYPTO_KeyBufWriteUnaligned(crypto,
                              operation->key,
                              (operation->key_len == 16U) ? cryptoKey128Bits
                              : cryptoKey256Bits);

  // Clear tag register (DATA2)
  for (uint32_t i = 0; i < 4; ++i) {
    crypto->DATA2 = 0;
  }

  // Start CBC-MAC with first block.
  update_cbc_mac(crypto, b);
  CORE_EXIT_CRITICAL();

  // Prepare counter block for encryption:
  // 0        .. 0        flags
  // 1        .. iv_len   nonce (aka iv)
  // iv_len+1 .. 15       counter (initially 1)

  // With flags as (bits):
  // 7 .. 3   0
  // 2 .. 0   q - 1

  ctr[0] = q - 1;
  memcpy(ctr + 1, iv, iv_len);
  memset(ctr + 1 + iv_len, 0, q);
  ctr[15] = 1;

  // Write the counter to CRYPTO.
  CORE_ENTER_CRITICAL();
  CRYPTO_DataWriteUnaligned(&crypto->DATA1, (uint8_t *)ctr);
  CORE_EXIT_CRITICAL();

  if (store_state_and_release) {
    CORE_ENTER_CRITICAL();
    CRYPTO_DataReadUnaligned(&crypto->DATA1, (uint8_t *)operation->ctx.ccm_ctx.cctr_state);
    CORE_EXIT_CRITICAL();
    crypto_management_release(crypto);
  }
  return PSA_SUCCESS;
}

// Update a CCM streaming operation with more input data to be
// encrypted or decrypted.
static psa_status_t sli_ccm_update(sli_crypto_transparent_aead_operation_t *operation,
                                   CRYPTO_TypeDef *device,
                                   size_t length,
                                   const unsigned char *input,
                                   unsigned char *output)
{
  size_t len_left;
  unsigned char b[16];
  const unsigned char *src;
  unsigned char *dst;

  CRYPTO_TypeDef *crypto;
  CORE_DECLARE_IRQ_STATE;

  if (length == 0) {
    return PSA_SUCCESS;
  }

  bool restore_state_and_release;
  // Check if this context has already acquired a crypto device, which means
  // the caller should be sli_ccm_crypt_and_tag() which will perform CCM
  // on a full block and call starts, update, finish in a sequence meaning we
  // will not need to store the state in between.
  if (device == NULL) {
    crypto = crypto_management_acquire();
    restore_state_and_release = true;
    ccm_restore_crypto_state(operation, crypto);
  } else {
    restore_state_and_release = false;
    crypto = device;
  }

  operation->processed_len += length;

  // Authenticate and {en,de}crypt the message.

  // The only difference between encryption and decryption is
  // the respective order of authentication and {en,de}cryption.
  len_left = length;
  src = input;
  dst = output;

  uint8_t out_buf[16];

  CORE_ENTER_CRITICAL();

  while (len_left > 0) {
    size_t use_len = len_left > 16 ? 16 : len_left;

    if (operation->direction == PSA_CRYPTO_DRIVER_ENCRYPT) {
      memset(b, 0, sizeof(b));
      memcpy(b, src, use_len);
      update_cbc_mac(crypto, b);
    }

    // Encrypt a message block with CTR.
    CRYPTO_DataWriteUnaligned(&crypto->DATA3, (uint8_t *)src);
    CRYPTO_EXECUTE_4(crypto,
                     // Generate key stream block.
                     CRYPTO_CMD_INSTR_DATA1TODATA0,
                     CRYPTO_CMD_INSTR_AESENC,
                     // Apply the key stream block to input.
                     CRYPTO_CMD_INSTR_DATA3TODATA0XOR,
                     // Increment counter.
                     CRYPTO_CMD_INSTR_DATA1INC);
    while ((crypto->STATUS & CRYPTO_STATUS_SEQRUNNING) != 0) ;
    CRYPTO_DataReadUnaligned(&crypto->DATA0, (uint8_t *)out_buf);

    memcpy(dst, out_buf, use_len);

    if (operation->direction == PSA_CRYPTO_DRIVER_DECRYPT) {
      memset(b, 0, sizeof(b));
      memcpy(b, dst, use_len);
      update_cbc_mac(crypto, b);
    }

    dst += use_len;
    src += use_len;
    len_left -= use_len;
  }

  CORE_EXIT_CRITICAL();
  // Save state and release.
  if (restore_state_and_release) {
    CORE_ENTER_CRITICAL();
    CRYPTO_DataReadUnaligned(&crypto->DATA1, (uint8_t *)operation->ctx.ccm_ctx.cctr_state);
    CORE_EXIT_CRITICAL();
    crypto_management_release(crypto);
  }
  return PSA_SUCCESS;
}

// Finish CCM streaming operation
static psa_status_t sli_ccm_finish(sli_crypto_transparent_aead_operation_t *operation,
                                   CRYPTO_TypeDef *device,
                                   unsigned char *tag,
                                   size_t tag_len)
{
  unsigned char i;
  unsigned char q;
  unsigned char ctr[16];
  uint8_t out_buf[16];
  CRYPTO_TypeDef *crypto;

  CORE_DECLARE_IRQ_STATE;

  bool restore_state_and_release;
  // Check if this context has already acquired a crypto device, which means
  // the caller should be sli_ccm_crypt_and_tag() which will perform CCM
  // on a full block and call starts, update, finish in a sequence meaning we
  // will not need to store the state in between.
  if (device == NULL) {
    crypto = crypto_management_acquire();
    restore_state_and_release = true;
    ccm_restore_crypto_state(operation, crypto);
  } else {
    restore_state_and_release = false;
    crypto = device;
  }

  q = 16 - 1 - (unsigned char) operation->ctx.ccm_ctx.iv_len;

  ctr[0] = q - 1;
  memcpy(ctr + 1, operation->ctx.ccm_ctx.iv, operation->ctx.ccm_ctx.iv_len);
  memset(ctr + 1 + operation->ctx.ccm_ctx.iv_len, 0, q);
  ctr[15] = 1;

  // Authentication: reset counter and crypt/mask internal tag.
  for (i = 0; i < q; i++) {
    ctr[15 - i] = 0;
  }

  CORE_ENTER_CRITICAL();

  // Encrypt the tag with CTR.
  CRYPTO_DataWriteUnaligned(&crypto->DATA0, (uint8_t *)ctr);

  CRYPTO_EXECUTE_2(crypto,
                   // Generate key stream block.
                   CRYPTO_CMD_INSTR_AESENC,
                   // Apply the key stream block to the tag.
                   CRYPTO_CMD_INSTR_DATA2TODATA0XOR);

  while ((crypto->STATUS & CRYPTO_STATUS_SEQRUNNING) != 0) ;

