espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_aead.c
  CRYPTO_DataReadUnaligned(&crypto->DATA0, (uint8_t *)out_buf);
  CORE_EXIT_CRITICAL();

  memcpy(tag, out_buf, tag_len);

  if (restore_state_and_release) {
    crypto_management_release(crypto);
  }

  return PSA_SUCCESS;
}
/*
 * Definition of CCM:
 * http://csrc.nist.gov/publications/nistpubs/800-38C/SP800-38C_updated-July20_2007.pdf
 * RFC 3610 "Counter with CBC-MAC (CCM)"
 *
 * Related:
 * RFC 5116 "An Interface and Algorithms for Authenticated Encryption"
 */

// Perform full CCM block encryption or decryption operation with tag
static psa_status_t sli_ccm_crypt_and_tag(sli_crypto_transparent_aead_operation_t *operation,
                                          psa_encrypt_or_decrypt_t mode,
                                          size_t length,
                                          const unsigned char *iv,
                                          size_t iv_len,
                                          const unsigned char *add,
                                          size_t add_len,
                                          const unsigned char *input,
                                          unsigned char *output,
                                          unsigned char *tag,
                                          size_t tag_len)
{
  psa_status_t status;
  CRYPTO_TypeDef *device = crypto_management_acquire();

  operation->ctx.preinit.add_len = add_len;

  status = sli_ccm_starts(operation, device, mode, iv, iv_len, tag_len, length);
  if (status != PSA_SUCCESS) {
    return status;
  }

  crypto_ccm_update_partial_ad(operation, device, add, add_len);

  status = sli_ccm_update(operation, device, length, input, output);

  if (status != PSA_SUCCESS) {
    return status;
  }
  status = sli_ccm_finish(operation, device, tag, tag_len);

  if (status != PSA_SUCCESS) {
    return status;
  }

  crypto_management_release(device);

  return PSA_SUCCESS;
}

#endif // PSA_WANT_ALG_CCM

#if defined(PSA_WANT_ALG_GCM) || defined(PSA_WANT_ALG_CCM)
static psa_status_t transparent_aead_encrypt_decrypt_setup(sli_crypto_transparent_aead_operation_t *operation,
                                                           const psa_key_attributes_t *attributes,
                                                           const uint8_t *key_buffer,
                                                           size_t key_buffer_size,
                                                           psa_algorithm_t alg,
                                                           psa_encrypt_or_decrypt_t operation_direction)
{
  if (operation == NULL
      || attributes == NULL
      || key_buffer == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  memset(operation, 0, sizeof(*operation));

  size_t key_bits = psa_get_key_bits(attributes);
  size_t key_size = PSA_BITS_TO_BYTES(key_bits);

  if (key_buffer_size < key_size) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  if (sizeof(operation->key) < key_size) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  switch (psa_get_key_bits(attributes)) {
    case 128:
      break;
    case 192:
      return PSA_ERROR_NOT_SUPPORTED;
    case 256:
      break;
    default:
      return PSA_ERROR_INVALID_ARGUMENT;
  }

  // Validate key type.
  if (psa_get_key_type(attributes) != PSA_KEY_TYPE_AES) {
    return PSA_ERROR_NOT_SUPPORTED;
  }

  // Validate tag length.
  if ( PSA_AEAD_TAG_LENGTH(psa_get_key_type(attributes), key_bits, alg) > 16 ) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  // Validate operation.
  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(alg, 0)) {
#if defined (PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
      operation->alg = alg;
      break;
#endif
#if defined (PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
      operation->alg = alg;
      operation->first_update_ad_op = true;
      break;
#endif
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }

  operation->key_len = key_size;
  memcpy(operation->key, key_buffer, key_size);

  operation->direction = operation_direction;

  return PSA_SUCCESS;
}
#endif //PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM

psa_status_t sli_crypto_transparent_aead_encrypt_setup(sli_crypto_transparent_aead_operation_t *operation,
                                                       const psa_key_attributes_t *attributes,
                                                       const uint8_t *key_buffer,
                                                       size_t key_buffer_size,
                                                       psa_algorithm_t alg)
{
#if defined(PSA_WANT_ALG_GCM) || defined(PSA_WANT_ALG_CCM)

  return transparent_aead_encrypt_decrypt_setup(operation, attributes, key_buffer, key_buffer_size,
                                                alg, PSA_CRYPTO_DRIVER_ENCRYPT);

#else //PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
  (void)operation;
  (void)attributes;
  (void)key_buffer;
  (void)key_buffer_size;
  (void)alg;
  return PSA_ERROR_NOT_SUPPORTED;
#endif //PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
}

psa_status_t sli_crypto_transparent_aead_decrypt_setup(sli_crypto_transparent_aead_operation_t *operation,
                                                       const psa_key_attributes_t *attributes,
                                                       const uint8_t *key_buffer,
                                                       size_t key_buffer_size,
                                                       psa_algorithm_t alg)
{
#if defined(PSA_WANT_ALG_GCM) || defined(PSA_WANT_ALG_CCM)

  return transparent_aead_encrypt_decrypt_setup(operation, attributes, key_buffer, key_buffer_size,
                                                alg, PSA_CRYPTO_DRIVER_DECRYPT);

#else //PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
  (void)operation;
  (void)attributes;
  (void)key_buffer;
  (void)key_buffer_size;
  (void)alg;
  return PSA_ERROR_NOT_SUPPORTED;
#endif //PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
}

psa_status_t sli_crypto_transparent_aead_set_nonce(sli_crypto_transparent_aead_operation_t *operation,
                                                   const uint8_t *nonce,
                                                   size_t nonce_size)
{
#if defined(PSA_WANT_ALG_GCM) || defined(PSA_WANT_ALG_CCM)
  if (operation == NULL || nonce == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  // Not able to set nonce twice.
  if (operation->ctx.preinit.nonce_length != 0) {
    return PSA_ERROR_BAD_STATE;
  }

  if (nonce_size > sizeof(operation->ctx.preinit.nonce)) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  // Validate nonce length.
  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(operation->alg, 0)) {
#if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
    {
      if (nonce_size != 12) {
        return PSA_ERROR_NOT_SUPPORTED;
      }
      break;
    }
#endif // PSA_WANT_ALG_GCM
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
    {
      if (nonce_size < 7 || nonce_size > 13) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }
      break;
    }
#endif // PSA_WANT_ALG_CCM
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }

  memcpy(operation->ctx.preinit.nonce, nonce, nonce_size);
  operation->ctx.preinit.nonce_length = nonce_size;

  return PSA_SUCCESS;

