espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_aead.c
#else // PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
  (void)operation;
  (void)nonce;
  (void)nonce_size;
  return PSA_ERROR_NOT_SUPPORTED;
#endif // PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
}

psa_status_t sli_crypto_transparent_aead_set_lengths(sli_crypto_transparent_aead_operation_t *operation,
                                                     size_t ad_length,
                                                     size_t plaintext_length)
{
#if defined(PSA_WANT_ALG_GCM) || defined(PSA_WANT_ALG_CCM)
  if (operation == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  // To pass current PSA Crypto test suite, tag length encoded in the
  // algorithm needs to be checked at this point.
  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(operation->alg, 0)) {
#if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
      (void)ad_length;
      (void)plaintext_length;
      if (PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg) < 4
          || PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg) > 16) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }
      break;
#endif
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
      if (PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg) < 4
          || PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg) > 16
          || PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg) % 2 != 0) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }
      if (ad_length >= 0xFF00) {
        return PSA_ERROR_INVALID_ARGUMENT;
      }
      operation->ctx.preinit.add_len = ad_length;
      operation->total_length = plaintext_length;
      break;
#endif
    default:
      return PSA_ERROR_BAD_STATE;
  }

  return PSA_SUCCESS;
#else // PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
  (void)operation;
  (void)ad_length;
  (void)plaintext_length;
  return PSA_ERROR_NOT_SUPPORTED;
#endif // PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
}

#if defined(PSA_WANT_ALG_GCM) || defined(PSA_WANT_ALG_CCM)
static psa_status_t crypto_aead_start(sli_crypto_transparent_aead_operation_t *operation)
{
  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(operation->alg, 0)) {
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
#if defined PSA_WANT_ALG_GCM
      {
        sli_gcm_starts(operation,
                       NULL,
                       operation->direction,
                       operation->ctx.preinit.nonce,
                       operation->ctx.preinit.nonce_length);
        break;
      }
#endif //  PSA_WANT_ALG_GCM
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
    {
      size_t tag_length = PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg);
      sli_ccm_starts(operation,
                     NULL,
                     operation->direction,
                     operation->ctx.preinit.nonce,
                     operation->ctx.preinit.nonce_length,
                     tag_length,
                     operation->total_length);
      break;
    }
#endif // PSA_WANT_ALG_CCM
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }
  return PSA_SUCCESS;
}
#endif // PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM

#if defined(PSA_WANT_ALG_GCM) || defined(PSA_WANT_ALG_CCM)
static psa_status_t crypto_aead_update_partial_ad(sli_crypto_transparent_aead_operation_t *operation,
                                                  CRYPTO_TypeDef *device,
                                                  const uint8_t *input,
                                                  size_t input_length)
{
  // First update_ad call.
  if (operation->add_len == 0) {
    crypto_aead_start(operation);
  }

  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(operation->alg, 0)) {
#if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
    {
      crypto_gcm_update_partial_ad(operation,
                                   device,
                                   input,
                                   input_length);
      break;
    }
#endif // PSA_WANT_ALG_GCM
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
    {
      crypto_ccm_update_partial_ad(operation,
                                   device,
                                   input,
                                   input_length);
      break;
    }
#endif // PSA_WANT_ALG_CCM
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }
  return PSA_SUCCESS;
}
#endif // PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM

psa_status_t sli_crypto_transparent_aead_update_ad(sli_crypto_transparent_aead_operation_t *operation,
                                                   const uint8_t *input,
                                                   size_t input_length)
{
#if defined(PSA_WANT_ALG_GCM) || defined(PSA_WANT_ALG_CCM)
  if (operation == NULL
      || (input == NULL && input_length > 0)) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  if (operation->alg == 0) {
    return PSA_ERROR_BAD_STATE;
  }

  if (operation->processed_len > 0) {
    return PSA_ERROR_BAD_STATE;
  }

  // AD are limited to 2^64 bits, so 2^61 bytes.
  // We need not check if SIZE_MAX (max of size_t) is less than 2^61 (0x2000000000000000).
#if SIZE_MAX > 0x2000000000000000ull
  if (input_length >> 61 != 0) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }
#endif

  // To make sure crypto_aead_start is not called twice.
  if (input_length == 0) {
    return PSA_SUCCESS;
  }

  // The following logic enables processing of partial non-blocksize authentication data.

  uint8_t block_size = 16;

#if defined(PSA_WANT_ALG_CCM)
  if (PSA_ALG_AEAD_WITH_SHORTENED_TAG(operation->alg, 0) == PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0)) {
    if (operation->first_update_ad_op) {
      // CCM only processes 14 bytes on its first update CBC-MAC operation.
      block_size = 14;
    }
  }
#endif

  if (operation->unprocessed_aad_length > 16) {
    // Context is not valid.
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  // Store up to 16 bytes in context in case there is more data coming. If there is no more
  // authentication data: stored data will be processed in the first update operation or in
  // the finish/verify operation.
  if ((operation->unprocessed_aad_length + input_length) < block_size && input_length < block_size) {
    memcpy(operation->unprocessed_block + operation->unprocessed_aad_length, input, input_length);
    operation->unprocessed_aad_length += input_length;
    return PSA_SUCCESS;
  }

  if (operation->unprocessed_aad_length > 0) {
    // If present, process any stored authenication data first.
    memcpy(operation->unprocessed_block + operation->unprocessed_aad_length, input, block_size
           - operation->unprocessed_aad_length);
    input += (block_size - operation->unprocessed_aad_length);
    input_length -= (block_size - operation->unprocessed_aad_length);
    operation->unprocessed_aad_length = 0;

    crypto_aead_update_partial_ad(operation,
                                  NULL,
                                  operation->unprocessed_block,
                                  block_size);

