espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_aead.c
    if (input_length < block_size) {
      memcpy(operation->unprocessed_block, input, input_length);
      operation->unprocessed_aad_length = input_length;
      return PSA_SUCCESS;
    }
  }

  uint8_t incomplete_block = (input_length - block_size) % 16;

  if (incomplete_block > 0) {
    memcpy(operation->unprocessed_block, input + (input_length - incomplete_block), incomplete_block);
    operation->unprocessed_aad_length = incomplete_block;
    input_length -= incomplete_block;
  }

  crypto_aead_update_partial_ad(operation,
                                NULL,
                                input,
                                input_length);

  return PSA_SUCCESS;

#else // PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
  (void)operation;
  (void)input;
  (void)input_length;
  return PSA_ERROR_NOT_SUPPORTED;
#endif // PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
}

psa_status_t sli_crypto_transparent_aead_update(sli_crypto_transparent_aead_operation_t *operation,
                                                const uint8_t *input,
                                                size_t input_length,
                                                uint8_t *output,
                                                size_t output_size,
                                                size_t *output_length)
{
#if defined(PSA_WANT_ALG_GCM) || defined(PSA_WANT_ALG_CCM)

  if (output_size < input_length) {
    return PSA_ERROR_BUFFER_TOO_SMALL;
  }

  if (operation == NULL
      || ((input == NULL || output == NULL) && input_length > 0)
      || output_length == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  if (operation->alg == 0) {
    return PSA_ERROR_BAD_STATE;
  }

  // If present, process authentication data.
  if (operation->unprocessed_aad_length > 0) {
    if (operation->unprocessed_aad_length > 16) {
      return PSA_ERROR_INVALID_ARGUMENT;
    }
    crypto_aead_update_partial_ad(operation,
                                  NULL,
                                  operation->unprocessed_block,
                                  operation->unprocessed_aad_length);
    operation->unprocessed_aad_length = 0;
    memset(operation->unprocessed_block, 0, sizeof(operation->unprocessed_block));
  }

  if (input_length == 0) {
    return PSA_SUCCESS;
  }

  // Deal with input that are not a multiple of 16.
  if ((operation->unprocessed_length + input_length) < 16 && input_length < 16) {
    if (operation->unprocessed_length > 16) {
      // Context is not valid.
      return PSA_ERROR_INVALID_ARGUMENT;
    }

    // Fill context buffer and end operation.
    memcpy(operation->unprocessed_block + operation->unprocessed_length, input, input_length);
    operation->unprocessed_length += input_length;
    *output_length = 0;

    return PSA_SUCCESS;
  }

  if (operation->processed_len == 0 && operation->add_len == 0) {
    // Multipart operation not initialized.
    crypto_aead_start(operation);
  }

  uint8_t input_offset = 0;
  uint8_t output_offset = 0;

  if (operation->unprocessed_length != 0) {
    if (operation->unprocessed_length > 16) {
      // Context is not valid.
      return PSA_ERROR_INVALID_ARGUMENT;
    }

    // If there is data stored in the context it must be processed first.
    input_offset = 16 - operation->unprocessed_length;

    memcpy(operation->unprocessed_block + operation->unprocessed_length, input, input_offset);

#if defined(PSA_WANT_ALG_GCM)
    if (PSA_ALG_AEAD_WITH_SHORTENED_TAG(operation->alg, 0) == PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0)) {
      sli_gcm_update(operation,
                     NULL,
                     sizeof(operation->unprocessed_block),
                     operation->unprocessed_block,
                     output);
    }
#endif
#if defined(PSA_WANT_ALG_CCM)
    if (PSA_ALG_AEAD_WITH_SHORTENED_TAG(operation->alg, 0) == PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0)) {
      sli_ccm_update(operation,
                     NULL,
                     sizeof(operation->unprocessed_block),
                     operation->unprocessed_block,
                     output);
    }
#endif

    input_length -= input_offset;
    output_offset += 16;
    input += input_offset;
    output += output_offset;

    sli_psa_zeroize(operation->unprocessed_block, sizeof(operation->unprocessed_block));
    operation->unprocessed_length = 0;

    if (input_length < 16) {
      // Fill context buffer and end operation.
      memcpy(operation->unprocessed_block, input, input_length);
      operation->unprocessed_length = input_length;
      *output_length = output_offset;

      return PSA_SUCCESS;
    }
  }
  // Store data that is not a multiple of 16 in context.
  uint8_t res_data_length = input_length % 16;
  memcpy(operation->unprocessed_block, input + (input_length - res_data_length),
         res_data_length);
  operation->unprocessed_length = res_data_length;
  input_length -= res_data_length;

  // Our drivers only support full or no overlap between input and output
  // buffers. So in the case of partial overlap, copy the input buffer into
  // the output buffer and process it in place as if the buffers fully
  // overlapped.
  if ((output > input) && (output < (input + input_length))) {
    memmove(output, input, input_length);
    input = output;
  }

  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(operation->alg, 0)) {
#if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
    {
      sli_gcm_update(operation,
                     NULL,
                     input_length,
                     input,
                     output);

      *output_length = input_length + output_offset;
      break;
    }
#endif // PSA_WANT_ALG_GCM
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
    {
      sli_ccm_update(operation,
                     NULL,
                     input_length,
                     input,
                     output);

      *output_length = input_length + output_offset;
      break;
    }
#endif
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }

  return PSA_SUCCESS;
#else // PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
  (void)operation;
  (void)input;
  (void)input_length;
  (void)output;
  (void)output_size;
  (void)output_length;
  return PSA_ERROR_NOT_SUPPORTED;
#endif // PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
}

psa_status_t sli_crypto_transparent_aead_finish(sli_crypto_transparent_aead_operation_t *operation,
                                                uint8_t *ciphertext,
                                                size_t ciphertext_size,
                                                size_t *ciphertext_length,
                                                uint8_t *tag,
                                                size_t tag_size,
                                                size_t *tag_length)
{
#if defined(PSA_WANT_ALG_GCM) || defined(PSA_WANT_ALG_CCM)

  (void)ciphertext;
  (void)ciphertext_size;

  if (operation == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  uint32_t tag_len = PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg);

  if (tag_size < tag_len) {
    return PSA_ERROR_BUFFER_TOO_SMALL;
  }

  *ciphertext_length = 0;

  // If present, process authentication data.
  if (operation->unprocessed_aad_length > 0) {
    if (operation->unprocessed_aad_length > 16) {
      return PSA_ERROR_INVALID_ARGUMENT;
    }
    crypto_aead_update_partial_ad(operation,
                                  NULL,
                                  operation->unprocessed_block,
                                  operation->unprocessed_aad_length);
    operation->unprocessed_aad_length = 0;
    memset(operation->unprocessed_block, 0, 16);
  }

  if ((operation->processed_len == 0) && (operation->add_len == 0)) {
    // Multipart operation not initialized.
    crypto_aead_start(operation);
  }

