espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/util/third_party/crypto/sl_component/sl_psa_driver/src/sli_crypto_transparent_driver_aead.c
  switch (PSA_ALG_AEAD_WITH_SHORTENED_TAG(operation->alg, 0)) {
#if defined(PSA_WANT_ALG_GCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_GCM, 0):
    {
      if (operation->unprocessed_length) {
        // Any unprocessed data in context must be processed first.
        if (ciphertext_size < operation->unprocessed_length) {
          return PSA_ERROR_INVALID_ARGUMENT;
        }
        sli_gcm_update(operation,
                       NULL,
                       operation->unprocessed_length,
                       operation->unprocessed_block,
                       ciphertext);

        *ciphertext_length = operation->unprocessed_length;
      }
      sli_gcm_finish(operation,
                     NULL,
                     tag,
                     tag_size);

      break;
    }
#endif //PSA_WANT_ALG_GCM
#if defined(PSA_WANT_ALG_CCM)
    case PSA_ALG_AEAD_WITH_SHORTENED_TAG(PSA_ALG_CCM, 0):
    {
      if (operation->unprocessed_length) {
        // Any unprocessed data in context must be processed first.
        if (ciphertext_size < operation->unprocessed_length) {
          return PSA_ERROR_INVALID_ARGUMENT;
        }
        sli_ccm_update(operation,
                       NULL,
                       operation->unprocessed_length,
                       operation->unprocessed_block,
                       ciphertext);

        *ciphertext_length = operation->unprocessed_length;
      }
      sli_ccm_finish(operation,
                     NULL,
                     tag,
                     tag_size);
      break;
    }
#endif
    default:
      return PSA_ERROR_NOT_SUPPORTED;
  }

  sli_psa_zeroize(operation, sizeof(*operation));

  *tag_length = tag_size;

  return PSA_SUCCESS;
#else// PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
  (void)operation;
  (void)ciphertext;
  (void)ciphertext_size;
  (void)ciphertext_length;
  (void)tag;
  (void)tag_size;
  (void)tag_length;
  return PSA_ERROR_NOT_SUPPORTED;
#endif// PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
}

psa_status_t sli_crypto_transparent_aead_verify(sli_crypto_transparent_aead_operation_t *operation,
                                                uint8_t *plaintext,
                                                size_t plaintext_size,
                                                size_t *plaintext_length,
                                                const uint8_t *tag,
                                                size_t tag_length)
{
#if defined(PSA_WANT_ALG_GCM) || defined(PSA_WANT_ALG_CCM)

  psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

  size_t tag_length_out = 0;

  uint8_t calc_tag[PSA_AEAD_TAG_MAX_SIZE] = { 0 };

  if (tag == NULL || tag_length == 0 ) {
    return PSA_ERROR_INVALID_SIGNATURE;
  }

  if (tag_length != PSA_ALG_AEAD_GET_TAG_LENGTH(operation->alg)) {
    return PSA_ERROR_INVALID_SIGNATURE;
  }

  status = sli_crypto_transparent_aead_finish(operation,
                                              plaintext,
                                              plaintext_size,
                                              plaintext_length,
                                              calc_tag,
                                              tag_length,
                                              &tag_length_out);

  if (status != PSA_SUCCESS) {
    return status;
  }

  if (tag_length != tag_length_out) {
    return PSA_ERROR_BAD_STATE;
  }

  // Check that the provided tag equals the calculated tag
  // (in constant time).
  uint8_t diff = sli_psa_safer_memcmp(calc_tag, tag, tag_length);
  sli_psa_zeroize(calc_tag, tag_length);

  if (diff != 0) {
    return PSA_ERROR_INVALID_SIGNATURE;
  }

  return PSA_SUCCESS;
#else // PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
  (void)operation;
  (void)plaintext;
  (void)plaintext_size;
  (void)plaintext_length;
  (void)tag;
  (void)tag_length;
  return PSA_ERROR_NOT_SUPPORTED;
#endif // PSA_WANT_ALG_GCM || PSA_WANT_ALG_CCM
}

psa_status_t sli_crypto_transparent_aead_abort(sli_crypto_transparent_aead_operation_t *operation)
{
  if (operation == NULL) {
    return PSA_ERROR_INVALID_ARGUMENT;
  }

  memset(operation, 0, sizeof(*operation));
  return PSA_SUCCESS;
}

#endif // CRYPTO_PRESENT
